[
    {
        "report_id": "FBI_1",
        "report_date": "4/28/2003",
        "report_description": [
            "This report concerns a bulletin issued on 2 April, 2003 by the Surete' \nde l'Etat in Paris concerning a Moroccan named Abdillah Zinedine, alias: Abu Hafs [See CIA \nreport for 17 April, 2003].The Surete' reported that Zinedine left Paris on a flight to \nMontreal, Canada on 1 April, 2003 and was traveling under a French passport in the name of \nMehdi Rafiki. A Mehdi Rafiki did arrive in Montreal on 2 April, 2003 and said the purpose \nof his visit was to attend the funeral of an uncle. He listed his Montreal contact address \nas 175 Rue Durocher. This address belongs to an Irish pub operated by a man named Patrick \nO'alley. O'alley says he never heard of any person named Mehdi Rafiki. But a man using a \nFrench passport in the name Abu Hafs rented a car at the Canadauto Car Rental Agency in \nMontreal on 2 April, 2003. This rented car was never returned to this agency. It was \ndiscovered abandoned on Walden Ave near Schiller Park in Buffalo, NY on 6 April, 2003\n"
        ],
        "persons": [
            "Abdillah Zinedine;Abu Hafs;Mehdi Rafiki;Patrick O'Malley\n"
        ],
        "dates": [
            "4/2/2003;4/1/2003;4/6/2003\n"
        ],
        "places": [
            " /Paris/ /France;175 Rue Durocher/Montreal/Quebec/Canada;Walden Ave./Buffalo/New \nYork/USA\n"
        ],
        "organizations": [
            "Surete' de l'Etat;Canadauto Car Rental Agency"
        ]
    },
    {
        "report_id": "FBI_2",
        "report_date": "5/12/2003",
        "report_description": [
            "Riyad Yasser, a UK citizen, was arrested on 1 May, 2003 following an \naccident on the M4 Motorway near the Heston Service Area outside of London. Yasser has \nbeen an air traffic controller at Heathrow Airport for the past six years. Two kilos of \nSemtex were found in the trunk of his car. A videocassette of a sermon given by Omar \nMahmoud Othman, formerly a Salafi jihad preacher at the Baker St. Mosque in London, was \nfound in Yasser's apartment at # 44, Northumberland Circle, East Bedfont, London. Also \nfound in Yasser's apartment was a note containing several addresses in Canada, the USA, \nand in Nassau in the Bahamas. The addresses are: 721 St. Clare St., Montreal; 455 11th \nStreet, Miami Beach, FL; 1712 Ferry Ave., Camden, NJ, and 11 Apple St. in Nassau, The \nBahamas.\n"
        ],
        "persons": [
            "Riyad Yasser;Omar Mahmoud Othman\n"
        ],
        "dates": [
            "5/1/2003\n"
        ],
        "places": [
            "M4 Motorway/London/ /UK;721 St. Clare St./Montreal/Quebec/Canada;455 11th \nSt./Miami Beach/Florida/USA;1712 Ferry Ave./Camden/New Jersey/USA;11 Apple St./Nassau/ \n/Bahamas;44 Northumberland Circle, East Bedfont/London/ /UK;Heathrow Airport/London/ /UK\n"
        ],
        "organizations": [
            "Baker St. Mosque"
        ]
    },
    {
        "report_id": "FBI_3",
        "report_date": "7/3/2003",
        "report_description": [
            "In response to the CIA report [29 June, 2003] regarding Abu Somad, 235 \nBuckthorn St, Inglewood CA, and Yazid Bafaba, 773 Flaxton St., Culver City, CA., \ninvestigators visited these two persons at their residences. Both Somad and Bafaba said \nthey had never heard of persons named Riduan Sungkar or Omar Evertts. Each of Somad and \nBafaba was asked if they knew the other and they replied that they did not. However, it \nwas later established that both Somad and Bafaba appeared together in a surveillance photo \ntaken at the CalNational Bank in Culver City. Records of this bank indicated that Somad \nand Bafaba hold a joint account at this bank and that they have received several deposits \nof $1000 to this account from BMI, a private Islamic investment company in Newark, NJ. \n"
        ],
        "persons": [
            "Abu Somad;Yazid Bafaba;Riduan Sungkar;Omar Evertts\n"
        ],
        "dates": [
            "\n"
        ],
        "places": [
            "235 Buckthorn St./Inglewood/California/USA;773 Flaxton St./Culver \nCity/California/USA; /Newark/New Jersey/USA"
        ],
        "organizations": []
    },
    {
        "report_id": "FBI_4",
        "report_date": "10/21/2003",
        "report_description": [
            "A man using an Illinois driver's license in the name Abu Hafs, address \n2211 Cermak Rd.. in Chicago, rented a car at the Drexel Car Rental Agency in Chicago on 27 \nSeptember, 2003. This car was never returned to the Drexel agency. It was found abandoned \nin a parking lot at O'Hare Airport on 2 October, 2003. On 27 April a roundtrip airline \nticket to Hobby Airport in Houston, Texas was issued by Central States Airline at O'Hare \nAirport to a man who gave his name as Mehdi Rafiki. Rafiki paid for this ticket in cash \nand used as identification a French passport in the name Mehdi Rafiki\n"
        ],
        "persons": [
            "Abu Hafs;Mehdi Rafiki\n"
        ],
        "dates": [
            "9/27/2003;10/2/2003;4/27/2003\n"
        ],
        "places": [
            "2211 Cermak Rd./Chicago/Illinois/USA;Hobby Airport/Houston/Texas/USA;O'Hare \nAirport/Chicago/Illinois/USA\n"
        ],
        "organizations": [
            "Drexel Car Rental Agency;Central States Airline"
        ]
    },
    {
        "report_id": "FBI_5",
        "report_date": "10/25/2003",
        "report_description": [
            "In identifying the presence of possible Hezbollah members in the \nCharlotte NC area, the name Rifai Qasim, has recently surfaced. An Egyptian passport in \nthe name of Rifai Qasim was found recently on the floor of the Southern Trailways bus \ndepot in Charlotte, NC. Examined by the Charlotte police, the picture on this passport \nmatches the appearance of a person using the name Omar Blakely, who was charged with the \ntheft, on 1 October, 2003, of several items [total value: $3000] from an electronics \nsupply store in Charlotte. Blakely gave his address as: 3131 Western Ave. in Charlotte. \nBlakely is now out on bail that was guaranteed by a bail bond company named BailOut, in \nCharlotte, NC. The $2,000 that this bond cost was paid by a check written on an account at \nthe Carolina First Bank held jointly in the names: Omar Blakely and Muhammed Mustafa. Bank \nrecords reveal periodic deposits to this account, usually in the amount of $3000, from an \naccount at the First Emirate Bank in Dubai, UAE. The Carolina First Bank account in the \nname of Blakely and Mustafa was closed on 23 October, 2003 and the house at 3131 Western \nAve is now unoccupied. However, a search through this abandoned house revealed the \nenvelopes of several letters addressed to Rifai Qasim.\n"
        ],
        "persons": [
            "Rifai Qasim;Omar Blakely;Muhammed Mustafa\n"
        ],
        "dates": [
            "10/1/2003;10/23/2003\n"
        ],
        "places": [
            "3131 Western Ave./Charlotte/North Carolina/USA; /Dubai/ /UAE\n"
        ],
        "organizations": [
            "BailOut;Hezbollah;Southern Trailways;Carolina First Bank;First Emirate Bank"
        ]
    },
    {
        "report_id": "FBI_6",
        "report_date": "10/26/2003",
        "report_description": [
            "Regarding Jamal al Quso, who was said by MI 5 to have come from London \nto Chicago in 1999 [see CIA report for 16 May, 2003], the Chicago FBI field office \nresponded by reporting that a Jamal al Quso had landed at O'Hare Airport on July 18, 1999 \nusing a British passport in his name. A check with USCIS reveals no evidence that he ever \nleft the USA since his arrival. In addition, the name Jamal al Quso has been associated by \nan informant with Islamic Jihad, which is known to have a presence in Chicago. On 28 \nSeptember, 2003 a house at 2211 Cermak Rd. in Chicago, said by the informer to be occupied \nby members of Islamic Jihad, was raided by an FBI team acting under a warrant. One person, \nAbdul Murad, was the only person at this residence at the time of the raid. Thirty kilos, \nof C-4 plastic explosives were found at this residence along with an additional 25 kilos \nof Semtex. Maps of O'Hare Airport and diagrams of the Sears Tower were also confiscated. \nMurad, now being held, has refused to say who the other occupants of this residence are. \nHowever, on a notepad found in the room Quso possibly occupied at this residence was "
        ],
        "persons": [],
        "dates": [],
        "places": [],
        "organizations": []
    },
    {
        "report_id": "FBI_7",
        "report_date": "11/6/2003",
        "report_description": [
            "RCMP reported the apprehension at Toronto Airport on 1 November, 2003 \nof a man posing as a Dominican priest. This man was traveling from CDG, Paris on a French \npassport under the name: Fr. Augustin Dominique, having the address 174 Rue Cardinet, \nParis. When asked a question about his destination in Toronto, the man mistakenly answered \nin Arabic rather than in French. CSIS have identified this man as Abdal al Hawsawi, a \nSaudi now known to have been associated with a chemical weapons expert in Afghanistan \nnamed Abdul Ahmed Nasser. On the ticket folder Hawsawi was carrying appeared the address: \n1712 Ferry St, Buffalo, NY.  \n"
        ],
        "persons": [
            "Fr. Augustin Dominique;Abdal al Hawsawi;Abdul Ahmed Nasser\n"
        ],
        "dates": [
            "11/1/2003\n"
        ],
        "places": [
            "Toronto Airport/Toronto/ /Canada;CDG/Paris/ /France;174 Rue Cardinet/Paris/ \n/France; / / /Afghanistan;1712 Ferry St./Buffalo/New York/USA\n"
        ],
        "organizations": [
            "RCMP;CSIS"
        ]
    },
    {
        "report_id": "FBI_8",
        "report_date": "11/11/2003",
        "report_description": [
            "On 1 November, 2003 Mousa Salah, of no fixed address in Herndon, VA., \nwas arrested at Dulles International Airport as he attempted to board a flight to London \nHeathrow. At the time of his arrest he was using a Jordanian passport in the name Shadi \nabu Hoshar. Salah has been wanted in connection with Hamas fund-raising and other \nactivities in Northern Virginia. It is believed that Salah entered the USA illegally from \nWindsor, Canada into Detroit, MI in 2002. Salah was in possession of a Virginia driver's \nlicense # T21-23-8820 registered in the name Mousa Salah. Virginia DOT records show that \nthis same license number was issued on 10 August, 2001 to a woman named April Stevens of \nRoanoke, VA. Ms Stevens is not the subject of further investigations; she teaches \nkindergarten classes in Roanoke. The address shown on Salah's driver's license does not \nexist. Several numbers and initials were written on the back of an envelope in possession \nof Salah at the time of his arrest; they are: (i) J. T., Detroit, (ii) A. H., Newark, \n(iii) M. M., Laurel. \n"
        ],
        "persons": [
            "Mousa Salah;Shadi abu Hoshar;April Stevens;J. T., Detroit;A. H., Newark;M. M., \nLaurel\n"
        ],
        "dates": [
            "11/1/2003;8/10/2001; / /2002\n"
        ],
        "places": [
            "Dulles International Airport/Dulles/Virginia/USA; /Herndon/Virginia/USA;Heathrow \nAirport/London/ /UK; /Windsor/Ontario/Canada; /Detroit/Michigan/USA; /Roanoke/Virginia/USA\n"
        ],
        "organizations": [
            "Hamas"
        ]
    },
    {
        "report_id": "FBI_9",
        "report_date": "11/20/2003",
        "report_description": [
            "Among the persons under surveillance for possible Al Qaeda associations \nin the USA is Khalid Shamrani, a Saudi national who lives and works in Houston, Texas for \nthe TexEast Petroleum Co. Shamrani has held a work visa since April, 2000. Suspicion first \nfell on Shamrani as a result of his attendance at a meeting of God's Aryan Militia in \nDenton, Texas on 12 March, 2003. He attended another meeting of this militia group in \nMineral Wells, Texas on 16 June, 2003. An FBI informant who attends the meetings of this "
        ],
        "persons": [],
        "dates": [],
        "places": [],
        "organizations": []
    },
    {
        "report_id": "FBI_10",
        "report_date": "11/27/2003",
        "report_description": [
            "Ahmed Doha and Abu Ayyash are both registered as graduate students at \nthe University of Missouri in Columbia, MO. Both Doha and Ayyash have Saudi student visas \nissued in July, 2001.  Doha was charged with filing a fraudulent insurance claim. On 10 \nOctober, 2003 Doha filed a claim with Ayyash's insurance company, Central Farmers Auto \nInsurance Co., for a back injury he said he suffered on 12 September, 2003 when his car \nwas struck from behind by one driven by Ayyash. Doha's insurance company is the Mid States \nInsurance Company. Both the Mid States and Central Farmers representatives who \nsubsequently investigated the accident and who handled this claim both stated that Doha \nand Ayyash said they did not know each other. Doha was paid $11,000 in settlement of this \nclaim on 1 November, 2003 by Central Farmer's Insurance Company. A check of the records at \nMid States and Central Farmers insurance companies reveals that both Doha and Ayyash paid \nfor their auto insurance policies from the same account at the Columbia First State Bank. \nOn a valid search warrant, Doha's apartment at 231 12th St. in Columbia was searched on 20 \nNovember, 2003 and it was discovered that Ayyash also lives in this apartment. A Dell \nlaptop computer at this residence was taken by the police. Also taken were CDs containing \na 7,000 page version of the Encyclopedia of Jihad. The computer, when examined, revealed \ne-mail messages to and from over 100 addresses in the USA. Many of these messages seemed \nto involve only personal and academic matters. But one message that attracted attention \nwas sent on 3 November, 2003 to an AOL address for a person identified as wshakur. This \nmessage read: \"4,000 you requested sent by wire today.\" This e-mail address belongs to \nWali Shakur, who lives at 224 Paulson Ave. in Clifton, NJ. Both Hamas and Al Qaeda are \nknown to have a presence in Columbia, MO. An investigation continues regarding the \npossible association of Doha and Ayyash with these groups.\n"
        ],
        "persons": [
            "Ahmed Doha;Abu Ayyash;Wali Shakur\n"
        ],
        "dates": [
            "7/ /2001;10/10/2003;9/12/2003;11/1/2003;11/20/2003;11/3/2003\n"
        ],
        "places": [
            "231 12th St./Columbia/Missouri/USA;224 Paulson Ave./Clifton/New Jersey/USA\n"
        ],
        "organizations": [
            "University of Missouri;Central Farmers Auto Insurance Co.;Mid States \nInsurance Company;Columbia First State Bank;AOL;Hamas;Al Qaeda"
        ]
    },
    {
        "report_id": "FBI_11",
        "report_date": "12/12/2003",
        "report_description": [
            "In response to a request, the FBI searched its files for information on \nsubjects having the initials J. T. [in Detroit, MI], A. H. [in Newark, NJ], and M. M. [in \nLaurel, MD]. Eight persons with initials J.T. were discovered in Detroit, but all these \npersons are known to the police and have no interesting information in their files. One \nperson was identified with the initials A. H. in Newark; his name is Adnan Hijazi. Hijazi \nhad been interviewed by the FBI following the 9/11/01 attacks. He was cleared of any \nassociation with these events and presently has no other entries on his record. There are \njust two persons in FBI files for Laurel, MD with initials M. M. One is Martha Mason and \nher file reveals that she was convicted on 21 January, 2002 for the distribution of "
        ],
        "persons": [],
        "dates": [],
        "places": [],
        "organizations": []
    },
    {
        "report_id": "FBI_12",
        "report_date": "12/28/2003",
        "report_description": [
            "A tip from an anonymous source directed investigators to a residence at \n2111 Troost Ave. in Kansas City, Missouri. This source said that explosives were being \nmanufactured at this residence by some terrorists who intended to blow up several \nbuildings in the Kansas City Area. A warrant was obtained to search this residence on \nevidence provided by an examination of items found in garbage sacks that were picked up by \nan FBI officer posing as a garbage collector. Traces of chemicals necessary to produce \nexplosives were found on items in this garbage. When this residence was searched on 22 \nDecember, 2003, one man, who gave his name as Walter Smith, was the only person at home. \nWhile the investigation was proceeding, another man entered and was apprehended. \nSubsequent identity checks revealed this man to be Jamal al Quso, who had come from \nChicago to Kansas City. What was found at this residence were batches of hexamethylene \ntriperoxide diamine [HMTD] and cyclotrimethylene trinitramine [RDX], both primary \nexplosives. Also found were three garbage sacks full of urea and aluminum sulfate. In \nlater investigations of this residence, detailed drawings were found of three popular \ncasinos in the Kansas City area: the Argosy Riverside Casino, the Isle of Capri Casino, \nand Harrah's Casino. \n"
        ],
        "persons": [
            "Walter Smith;Jamal al Quso;\n"
        ],
        "dates": [
            "12/22/2003;\n"
        ],
        "places": [
            "2111 Troost Ave./Kansas City/Missouri/USA; /Chicago/Illinois/USA;the Argosy \nRiverside Casino/Kansas City/Missouri/USA;the Isle of Capri Casino/Kansas \nCity/Missouri/USA;Harrah's Casino/Kansas City/Missouri/USA;\n"
        ],
        "organizations": [
            "FBI;"
        ]
    },
    {
        "report_id": "FBI_13",
        "report_date": "1/2/2004",
        "report_description": [
            "On 26 December, 2003 two men were arrested during a robbery attempt at \nthe FirstTex Bank at 435 Fielder Rd. in Arlington, Texas. The two men, both wearing ski \nmasks, were apprehended by Arlington police as they fled from the bank. The men were \nidentified as Saeed al Nami and Riyad al Taifi, both living at 2727 Robinson Rd, Apartment \n6, in Grand Prairie, Texas. Each one had a Texas driver's license that was forged, and \nneither could produce a passport of any kind. They both said they had entered the USA from \nMexico at Presidio, Texas and had come to Mexico by way of Central America from Columbia. \nBoth spoke perfect English and were unemployed at the time. An investigation of their \nresidence revealed money in bags identified as belonging to several other banks in the \nDallas area. The total amount in the bags amounted to $42,010. In addition, there were \nsmall arms of various sorts and literature concerning jihad activities. They rented this \napartment from a woman named Ruth Tucker, who said that they had lived in this apartment \nfor three months, had never caused any trouble, and paid their rent on time. She also said \nthat they had told her they were students at the University of Texas in Arlington. One \nitem of mail was discovered in their apartment; it was a letter written in Arabic from a "
        ],
        "persons": [],
        "dates": [],
        "places": [],
        "organizations": []
    },
    {
        "report_id": "FBI_14",
        "report_date": "2/7/2004",
        "report_description": [
            "Based on the information about Wali Shakur, noted in the FBI report of \n27 November, 2003, agents were sent to interview him at the 224 Paulson Ave. Clifton NJ \naddress given in this report. Before this interview information was obtained about \nShakur's background. He is an American citizen, having been born in 1970 in New Brunswick, \nNJ of parents who were immigrants from Pakistan in 1965. Shakur attended Rutgers \nUniversity for two years , dropping out in 1990 in order to study at the American \nUniversity in Beirut, Lebanon. He returned to the USA in 1993. Shakur was shown a copy of \nthe e-mail he had received from either Ahmed Doha or Abu Ayyash on 3 November, 2003. He \nwas also asked what the 4,000 in this message referred to. Shakur replied that both Doha \nand Ayyash were students at the University of Missouri and were good friends of his father \nand that he, Shakur, did not know them personally. Shakur said that his father had in 2001 \nloaned them $8,000 and had not yet received any payment on this loan. Shakur said he \nrequested at least half payment on this loan and later received a Western Union wire of \n$4,000 from Doha. Shakur said he gave the cash to his father. Asked for his father's \naddress, Shakur said his father had died on 2 January, 2004. Shakur's activities remain \nthe subject of FBI investigations.\n"
        ],
        "persons": [
            "Wali Shakur;Ahmed Doha;Abu Ayyash\n"
        ],
        "dates": [
            " / /1970; / /1990;11/3/2003;1/2/2004\n"
        ],
        "places": [
            "224 Paulson Ave./Clifton/New Jersey/USA; /New Brunswick/New Jersey/USA; / / \n/Pakistan; / / /Lebanon\n"
        ],
        "organizations": [
            "Rutgers University;American University in Beirut;University of \nMissouri;Western Union;FBI"
        ]
    },
    {
        "report_id": "FBI_15",
        "report_date": "2/13/2004",
        "report_description": [
            "Jamal al Shibh, of Yemeni origin, has been the Imam at the Tawhid \nMosque in Miami, Florida for the past ten years. As a result of recent reports provided by \ninformants about al Shibh's call for jihad in America, he has been under surveillance. He \nwas photographed on 2 February, 2004, on the University of Miami campus in Coral Gables, \ndistributing literature, written in Arabic, at various locations known to be frequented by \nIslamic students. This literature describes how well the city of Miami illustrates that \nAmerica has become a sink of vice and corruption. Examples are provided of the easy \navailability of sex and drugs in the Miami area. This literature also calls for immediate \njihadic action in order to prevent the corruption of Muslims in America. Especially \nsingled out in this literature is the tourist industry in the Miami area.\n"
        ],
        "persons": [
            "Jamal al Shibh\n"
        ],
        "dates": [
            "2/2/2004\n"
        ],
        "places": [
            " /Miami/Florida/USA; /Coral Gables/Florida/USA\n"
        ],
        "organizations": [
            "Tawhid Mosque;University of Miami"
        ]
    },
    {
        "report_id": "FBI_16",
        "report_date": "2/14/2004",
        "report_description": [
            "Update on the surveillance of Adnan Hijazi. Checks with airlines reveal "
        ],
        "persons": [],
        "dates": [],
        "places": [],
        "organizations": []
    },
    {
        "report_id": "FBI_17",
        "report_date": "2/16/2004",
        "report_description": [
            "Further information regarding the activities of Jamal al Shibh. When he \nwas observed distributing the jihadic literature on the University of Miami campus, he was \naccompanied by a person who has now been identified. He is Muhammed Dandani, whose \nresidence is 455 11th St. in Miami Beach, FL. There is no further information about \nDandani.\n"
        ],
        "persons": [
            "Jamal al Shibh;Muhammed Dandani\n"
        ],
        "dates": [
            "\n"
        ],
        "places": [
            "455 11th St./Miami Beach/Florida/USA\n"
        ],
        "organizations": [
            "University of Miami"
        ]
    },
    {
        "report_id": "FBI_18",
        "report_date": "3/8/2004",
        "report_description": [
            "In response to a DIA report of 5 March regarding Abdul al Nami, a check \nwas made of persons with this name in the Detroit area. There are two persons having this \nname in the Detroit area. One lives at 562 Fenkell Ave. and the other lives at 766 \nLivernois Rd. Neither of these two persons have been the subject of FBI investigations in \nthe past. It is now known that the 562 Fenkell Ave. resident is employed as a computer \nscientist by Detroit Utilities Co. and has worked there for seven years. He holds an \nAmerican passport giving this address and has lived in the USA for ten years. The resident \nat 766 Livernois Rd. is a history teacher at the Westfields High School in the Ferndale \narea and was born in the USA of Saudi parents in 1969. Investigation of these two persons \ncontinues.\n"
        ],
        "persons": [
            "Abdul al Nami\n"
        ],
        "dates": [
            " / /1969\n"
        ],
        "places": [
            "562 Fenkell Ave./Detroit/Michigan/USA;766 Livernois Rd./Detroit/Michigan/USA; \n/Ferndale/Michigan/USA\n"
        ],
        "organizations": [
            "FBI;Detroit Utilities Co.;Westfields High School"
        ]
    },
    {
        "report_id": "FBI_19",
        "report_date": "3/15/2004",
        "report_description": [
            "Further information regarding Saeed al Nami and and Riyad al Taifi who \nwere apprehended on 26 December, 2003 during a robbery attempt in Arlington, Texas [see \nFBI report 2 January, 2004]. Both of these individuals are Saudis who came to Buenos \nAires, Argentina in January of 2001. They are both wanted by the police in Buenos Aires \nfor their role in the bombing of a Jewish synagogue in Buenos Aires in April of 2002. \nEscaping apprehension, they went to Calamar, Columbia in May, 2002,  where they are now \nknown to have been active in collaborating with the ELN. In January, 2003 they came to the \nUSA following a route taken by other Islamic militants known to have come into the USA. \nThis route took them from Calamar to Cartagena in Columbia and then by boat to Guane in \nCuba. They then went by boat from Guane, Cuba to Chetumal, Mexico. From Chetumal they \ntraveled to Mexico City and then on to the border town of Ojinaga, where they were \nsmuggled into Presidio, Texas. In Ojinaga they were both supplied with Texas driver's \nlicenses and U.S. currency by a person whose name they said they could not remember. They "
        ],
        "persons": [],
        "dates": [],
        "places": [],
        "organizations": []
    },
    {
        "report_id": "FBI_20",
        "report_date": "3/29/2004",
        "report_description": [
            "Further information about Abdul al Nami who works as a computer \nscientist for the Detroit Utilities Co. [see FBI report 8, March, 2004]. Nami came to the \nUSA from Saudi Arabia in 1994 on a student visa to attend the University of Michigan at \nAnn Arbor. He earned an MA 1996 in computer science and was granted a green card in 1997 \nfor work at the Detroit Utilities Co. He applied for U.S. citizenship in 1999, which was \ngranted in April of 2000. Officials at the Detroit Utilities Co say that al Nami is a \nsplendid worker who has intimate knowledge of the SCADA system and was instrumental in \nincreasing the efficiency of electric power distribution in the Detroit area. Officials \nsaid he took a six-months' leave of absence in January, 2001 to visit his family in \nRiyadh. \n"
        ],
        "persons": [
            "Abdul al Nami\n"
        ],
        "dates": [
            " / /1994; / /1996; / /1997; / /1999;4/ /2000;1/ /2001\n"
        ],
        "places": [
            " / / /Saudi Arabia; /Ann Arbor/Michigan/USA; /Detroit/Michigan/USA; /Riyadh/ \n/Saudi Arabia\n"
        ],
        "organizations": [
            "Detroit Utilities Co.;University of Michigan at Ann Arbor"
        ]
    },
    {
        "report_id": "FBI_21",
        "report_date": "4/18/2004",
        "report_description": [
            "Received information from  MI 6 about Imad Dahdah, who resides at #65 \nWest End Ave. in Nassau, The Bahamas. Dahdah was born in Syria in 1964 and came to the UK \nin 1994. He became active in Islamic affairs and regularly attended the Baker St. mosque. \nHe obtained British citizenship in 1998 and travels under a British passport. He traveled \nto Afghanistan in 1999 - 2000 and is now suspected of having been trained at an Al Qaeda \nfacility during this time. Dahdah returned to the UK in March of 2000 but left for The \nBahamas in June of 2000. He works at an auto repair shop for a minimum wage but is now \nknown to receive periodic funds from an account at the Gulf Shores Bank in Tampa, FL. The \naccount from which these funds are drawn belongs to an organization named Middle Eastern \nCharities.\n"
        ],
        "persons": [
            "Imad Dahdah\n"
        ],
        "dates": [
            " / /1964; / /1994; / /1998; / /1999; 3/ /2000;6/ /2000\n"
        ],
        "places": [
            "65 West End Ave./Nassau/ /Bahamas; / / /Syria; / / /UK; / / /Afghanistan; \n/Tampa/Florida/USA\n"
        ],
        "organizations": [
            "MI 6;Baker St. mosque;Al Qaeda;Gulf Shores Bank;Middle Eastern Charities"
        ]
    },
    {
        "report_id": "FBI_22",
        "report_date": "5/10/2004",
        "report_description": [
            "Information received from MI 5 regarding Raeed Beandali, an American \ncitizen who was listed on Al Qaeda rosters [see CIA report 15 Feb. 2003]. According to "
        ],
        "persons": [],
        "dates": [],
        "places": [],
        "organizations": []
    },
    {
        "report_id": "FBI_23",
        "report_date": "6/1/2004",
        "report_description": [
            "The bail bond company BailOut in Charlotte NC forfeited the $10,000 \nbail bond it guaranteed for Rifai Qasim [alias Omar Blakely] in connection with the theft \ncharge against him [see FBI Report 25 October, 2003]. When this bail bond company's \ninvestigators failed to locate Qasim/Blakely after four weeks, they turned the matter over \nto the FBI. Qasim and his associate Muhammed Mustafa closed their joint bank account at \nthe Carolina First Bank on 23 October, 2003 and fled in a 1997 Toyota Tercel, NC license # \nTQE-732. A 1997 Toyota Tercel bearing this license number was found abandoned in River \nRouge Park in Detroit, MI on 15 December, 2003. Overlooked in the initial examination of \nthis vehicle by Detroit police, but later found by FBI investigators, was a slip of paper \nwith a phone number on it. The phone number is listed in the name Abdul al Nami, who \nresides at 562 Fenkell Ave. in Detroit, MI. Acting on information obtained in DIA Report 5 \nMarch, 2004, a court-sanctioned tap was placed on this phone. On 15 May, 2004 a call was \nplaced from this phone to a residence at 237 Hayes Ave in Detroit. The caller said: \n\"Rifai, we are all together now. We will let you know when the match will be played. It \nmight take some time to get the right field.\" The person receiving the call says: \"I hope \nit will not be too long, my side is really ready to play.\" Investigators went to the \nresidence at 237 Hayes Ave. on 20 May, 2004 and found it to be unoccupied. Neighbors said \nthat the two Middle Eastern men who had occupied this residence briefly had moved out just \na few days earlier. The owner of this residence, a Mr. Howard Clark, said he had evicted \nthe two men because they failed to pay their rent for two months. Clark did not know where \nthey went.\n"
        ],
        "persons": [
            "Rifai Qasim;Omar Blakely;Muhammed Mustafa;Abdul al Nami;Howard Clark\n"
        ],
        "dates": [
            "10/23/2003;12/15/2003;5/15/2004;5/20/2004\n"
        ],
        "places": [
            " /Charlotte/North Carolina/USA;River Rouge Park/Detroit/Michigan/USA;562 Fenkell \nAve./Detroit/Michigan/USA;237 Hayes Ave/Detroit/Michigan/USA\n"
        ],
        "organizations": [
            "BailOut;FBI;Carolina First Bank;Detroit police"
        ]
    },
    {
        "report_id": "FBI_24",
        "report_date": "7/17/2004",
        "report_description": [
            "More information is available about the overseas trips taken by Adnan \nHijazi. In Madrid, between 2 - 5 December, 2003, he stayed at the Catalan Hotel and \nattended a three-day textiles convention. In Cairo, between 22 - 24 December, 2003, he \nstayed at the Luxor Hotel. During his stay in Cairo at this time he made regular visits to \na jewelry shop at 411 Ramses St. in Cairo. In Paris, France, between 13 - 18 January, 2004 \nhe stayed at the Hotel de St. Marie and attended daily meetings at the Paris offices of \nOverseas Exports Inc."
        ],
        "persons": [],
        "dates": [],
        "places": [],
        "organizations": []
    },
    {
        "report_id": "FBI_25",
        "report_date": "8/7/2004",
        "report_description": [
            "The FBI informant who attends meetings of God's Aryan Militia [GAM] in \nTexas reports having recorded a conversation between Khalid Shamrani [see FBI Report: 20 \nNovember, 2003] and three other men, two of whom the informant identified as Billy Jack \nHawkins and Slade Goodman, both of whom are members of GAM. The third person our informant \ncould only identify as a Middle Easterner named \"Hafs\" or \"Halfs\". This was the name given \nhim by Shamrani. The gist of this conversation, which took place at the Westerner Motel on \nAlmeda-Genoa Rd. in Houston, was that actions involving destructive activities in the \nHouston area and elsewhere would be placed on hold for at least several months. They \ndiscussed the apprehension of a militia member named Walter Smith and another person named \nal Quso in Kansas City. The fear they expressed was that their actions were being \ncompromised.\n"
        ],
        "persons": [
            "Khalid Shamrani;Billy Jack Hawkins;Slade Goodman;Hafs or Halfs;Walter Smith;al \nQuso\n"
        ],
        "dates": [],
        "places": [
            "Almeda-Genoa Rd/Houston/Texas/USA; /Kansas City/ /USA\n"
        ],
        "organizations": [
            "God's Aryan Militia [GAM]"
        ]
    },
    {
        "report_id": "FBI_26",
        "report_date": "8/20/2004",
        "report_description": [
            "This report concerns results of an FBI interview of the two men \napprehended in Carrizo Springs, TX on 3 August, 2004 [See USCBP Report for 11 August, \n2004]. Both men spoke perfect English and were very cordial. But they refused to answer \nany questions and asked to be represented by an attorney. They were fingerprinted and held \nin custody. Further examination of documents in their possession when they were \napprehended revealed a letter, written in Arabic, from a person named Abdul Nasser. This \nletter was addressed to a person named Ali al-Omari. This letter simply said: \"Go forth \nwith Allah's blessing. You have been my best student.\" Investigation of these two men \ncontinues.\n"
        ],
        "persons": [
            "Abdul Nasser;Ali al-Omari\n"
        ],
        "dates": [
            "8/3/2004\n"
        ],
        "places": [
            " /Carrizo Springs/Texas/USA\n"
        ],
        "organizations": []
    },
    {
        "report_id": "FBI_27",
        "report_date": "9/27/2004",
        "report_description": [
            "This report concerns continuing surveillance of the activities of Adnan \nHijazi. During the period 20 August to 18 September, 2004 Hijazi made thirteen cash \ndeposits to his personal account at the Jersey National Bank in Newark, NJ. These deposits \ntotaled $47,980.\n"
        ],
        "persons": [
            "Adnan Hijazi\n"
        ],
        "dates": [
            "\n"
        ],
        "places": [
            "Jersey National Bank/Newark/New Jersey/USA\n"
        ],
        "organizations": [
            "Jersey National Bank"
        ]
    },
    {
        "report_id": "FBI_28",
        "report_date": "10/1/2004",
        "report_description": [
            "Information was requested of Belgian intelligence by the FBI on 1 \nSeptember about Pieter Dopple, who lives at 22 Hoveniersstraat, Antwerp, Belgium. He sent \nthe diamonds to Adnan Hijazi as noted in the USCBP report of 12 July, 2004. Belgian \nintelligence reports that Dopple has been under surveillance as a fence for diamonds \nobtained by groups, many of them associated with Islamic ventures, in various places in \nAfrica. It appears that Dopple receives raw diamonds and other precious stones such as \ntanzanite and cuts and polishes them for distribution. Dopple receives a fee for his \nservices but does not sell the stones himself. He sends them where his suppliers specify. \nAt his interrogation, Dopple admitted that he was part of a scheme for transferring funds \nfor militant Islamic groups and agreed to cooperate with investigators. He listed several \npersons in addition to Hijazi to whom he had sent polished diamonds and tanzanite. One \nperson he named was Ramundo Ortiz, who runs a business in Panama City, Panama. He further \nsaid that he had just sent about $150,000 in polished diamonds to Ortiz on 25 September. \nAsked for the identity of the person(s) who had requested this transaction, he could only \nsay that they were from Peshawar in Pakistan.\n"
        ],
        "persons": [
            "Pieter Dopple;Adnan Hijazi;Ramundo Ortiz\n"
        ],
        "dates": [
            "9/1/2004;7/12/2004;9/25/2004\n"
        ],
        "places": [
            "22 Hoveniersstraat/Antwerp/ /Belgium; /Panama City/ /Panama; / /Peshawar/Pakistan\n"
        ],
        "organizations": [
            "militant Islamic groups"
        ]
    },
    {
        "report_id": "FBI_29",
        "report_date": "10/10/2004",
        "report_description": [
            "This special alert concerns assorted vulnerabilities of the SCADA \nsystems. These Supervisory Control and Data Acquisition systems manage the actual flow of \nelectricity and natural gas and perform other critical functions in a variety of other \nindustries including chemical processing plants, water purification systems, delivery \nsystems, and other manufacturing systems. SCADA is largely controlled and maintained by \nU.S. industries and crucial operations of SCADA are widely available on the Internet. \nUnauthorized access to SCADA is a constant source of concern. SCADA could be accessed from \nhome computers and laptops. Of special interest are vulnerabilities associated with \n\"trusted insiders.\"\n"
        ],
        "persons": [
            "\n"
        ],
        "dates": [],
        "places": [],
        "organizations": [
            "SCADA systems"
        ]
    },
    {
        "report_id": "FBI_30",
        "report_date": "10/11/2004",
        "report_description": [
            "Continuing surveillance of Adnan Hijazi reveals that, on 14 September, \n2004, he sent a bank wire transfer of $48,000 to the account of an organization called the \nAmerican Islamic Scholarship Fund, which is located at 1721 Glade Dr. in Reston, VA.\n"
        ],
        "persons": [
            "Adnan Hijazi\n"
        ],
        "dates": [
            "9/14/2004\n"
        ],
        "places": [
            "1721 Glade Dr/Reston/Virginia/USA\n"
        ],
        "organizations": [
            "American Islamic Scholarship Fund"
        ]
    },
    {
        "report_id": "FBI_31",
        "report_date": "10/13/2004",
        "report_description": [
            "Acting immediately in response to the FBI HQ alert of 11 October, 2004, "
        ],
        "persons": [],
        "dates": [],
        "places": [],
        "organizations": []
    },
    {
        "report_id": "FBI_32",
        "report_date": "10/21/2004",
        "report_description": [
            "Our informant in God's Aryan Militia advises that he has not seen \nKhalid Shamrani for nearly a month and that efforts to contact him at his home in \nBellaire, Texas have been unsuccessful. Investigators immediately went to TexEast \nPetroleum Co. where Shamrani has been employed. Officials at this company said that on 18 \nSeptember, 2004 Shamrani had requested a month's leave of absence in order to return to \nSaudi Arabia to be with his dying mother. Shamrani had been placed on a watch list and \nsubsequent checks with USCIS reveal that no one named Shamrani had left the USA in the \npast month.\n"
        ],
        "persons": [
            "Khalid Shamrani\n"
        ],
        "dates": [
            "9/18/2004\n"
        ],
        "places": [
            " /Bellaire/Texas/USA; / / /Saudi Arabia\n"
        ],
        "organizations": [
            "God's Aryan Militia;TexEast Petroleum Co"
        ]
    },
    {
        "report_id": "FBI_33",
        "report_date": "10/25/2004",
        "report_description": [
            "Investigation of the residence at 3236 Pine St. in Bellaire, Texas \nrevealed a receipt for the rental of a storage unit # 124 at the StoreAll Rental facility \nat 4618 Bissonnet St. in Houston. Unit 124 was empty but careful examination of it \nrevealed traces of C-4 and Semtex. The owner of StoreAll Rental said that the renter of \nunit 124 had told him on 15 October, 2004 that he would not need this unit any longer. The \nowner remembered that four men, using a RentAll truck had removed the contents of this \nstorage unit the next day.\n"
        ],
        "persons": [
            "\n"
        ],
        "dates": [
            "10/15/2004\n"
        ],
        "places": [
            "3236 Pine St/Bellaire/Texas/USA;4618 Bissonnet St./Houston/Texas/USA\n"
        ],
        "organizations": [
            "StoreAll Rental"
        ]
    },
    {
        "report_id": "FBI_34",
        "report_date": "10/28/2004",
        "report_description": [
            "The RCMP reported to us the results of their investigation of the \nactivities of Satam [alias Ronald] Derwish, 811 Tecumseh Rd., Windsor, Ontario. On 25 \nOctober, Derwish was approached by officers at his place of work at Canada Eastern \nAirlines in Windsor. The officers said that Derwish agreed to accompany them to the RCMP \nmain office in Windsor. During his interview Derwish denied having any contact with a \nperson in Marrakech, Morocco [see NSA Report: 1 July, 2003; also see DIA Report: 5 March, \n2004] and said he had no idea who \"Abdul\" was. Shown a photo of him [Derwish] in company \nwith Abdul al Nami in Detroit on 18 July, 2004, Derwish said: \"I never knew him by the "
        ],
        "persons": [],
        "dates": [],
        "places": [],
        "organizations": []
    },
    {
        "report_id": "FBI_35",
        "report_date": "11/5/2004",
        "report_description": [
            "On 29 October, 2004 investigators went to the offices of the American \nIslamic Scholarship Fund located at 1721 Glade Dr. in Reston VA. There they interviewed \nthe director of this fund, a man named Abdul Karim. Karim led the initial discussion and \ndescribed how many deserving students of Islamic descent had been assisted by this \nscholarship fund since it was begun in 1991. Karim was first asked if this Fund did indeed \nreceive the $48,000 scholarship donation made by a man named Adnan Hijazi on 14 September, \n2004. Checking his records, Karim verified the receipt of this donation by Karim. Then \nKarim was asked for the names of persons who received money from this donation from \nHijazi. Karim hesitated at first and then said: \"Every now and then we receive money from \ndonors who identify the students to whom the scholarship money should go. This happened in \nthe case of Hijazi's donation.\" Checking his records again, Karim said: \"HIjazi stipulated \nthat $8,000 should go to each one of the following students: Wali Shakur, 224 Paulson Ave. \nCLifton, NJ; Hamza al Midhar, 1641 Pitkin Ave. Brooklyn, NY; Mounir Mzoudi, 2116 27th St. \nLaurel, MD; Mamoun Zammar, 1621 Charles Ave., Potomac, MD; Said Khadr, 6132 Broward Blvd., \nFort Lauderdale, FL; Muhammed Dandani, 455 11th St., Miami Beach, FL.\" Karim then said \nthat these amounts of money were sent to each of these persons on 17 September, 2004. \nFinally, Karim was asked if Hijazi had made any other donations to this fund in the past.  \nKarim said that his recollection was that Hijazi had contributed to the scholarship fund \non two other occasions, once in 1999 and once in 2001.\n"
        ],
        "persons": [
            "Abdul Karim;Adnan Hijazi;Wali Shakur;Hamza al Midhar;Mounir Mzoudi;Mamoun \nZammar;Said Khadr;Muhammed Dandani\n"
        ],
        "dates": [
            "10/29/2004;9/14/2004;9/17/2004\n"
        ],
        "places": [
            "1721 Glade Dr/Reston/Virginia/USA;224 Paulson Ave/Clifton/New Jersey/USA;1641 \nPitkin Ave/Brooklyn/New York/USA;2116 27th St./Laurel/Maryland/USA;1621 Charles \nAve./Potomac/Maryland/USA;6132 Broward Blvd/Fort Lauderdale/Florida/USA; 455 11th \nSt./Miami Beach/Florida/USA\n"
        ],
        "organizations": [
            "American Islamic Scholarship Fund"
        ]
    },
    {
        "report_id": "FBI_36",
        "report_date": "11/7/2004",
        "report_description": [
            "Results of investigation of Abdul al Nami in Detroit. As requested, al \nNami arrived at the Detroit office on the morning of 27 October, 2004. He was first asked \nabout his association with Satam [alias Ronald] Derwish in Windsor, Ontario. al Nami said \nthat they were friends and that they attended the same mosque in Detroit. He was then \nasked if he had corresponded with anyone in Marrakech, Morocco; he replied that he had \nnever done so. Then he was asked if he had ever met or had any dealings with a person \nnamed Khaled Jehani [see DIA Report: 5 March, 2004]. al Nami replied that he had never \nheard of this person. Asked what the nature of his work was at Detroit Utilities Co. and \nhow it involved the SCADA systems, al Nami replied that it was his job to make sure that \nhis company made full use of the operational characteristics of these control and data \nacquisition systems. Asked if he ever accessed these systems from his home, al Nami \nreplied that the demands of his job required that he do lots of work at home at nights and \non weekends. Asked if he had ever heard about a project called \"Black Ice\", he said he had \nnot. On evidence supplied by the various communications received regarding al Nami, a "
        ],
        "persons": [],
        "dates": [],
        "places": [],
        "organizations": []
    },
    {
        "report_id": "FBI_37",
        "report_date": "12/3/2004",
        "report_description": [
            "On 1 December, 2004 this office received in the mail a letter signed \n\"Ramon\". This letter was mailed from a post office at Gulfgate in Houston but carried no \nreturn address. The letter said that a stain of Type A foot and mouth disease was now in \nTexas and that cattlemen around Victoria, TX would be the first to suffer. The note also \nsaid that members of FARC had traveled from Cartagena, Columbia to Guane, Cuba, to \nChetumal, Mexico, to Piedras Negras, Mexico, and then to Victoria, TX.\n"
        ],
        "persons": [
            "Ramon\n"
        ],
        "dates": [
            "12/1/2004\n"
        ],
        "places": [
            " /Houston/Texas/USA; /Victoria/Texas/USA; /Cartagena/Columbia/USA; /Guane/ /Cuba; \n/Chetumal/ /Mexico; /Piedras Negras/ /Mexico\n"
        ],
        "organizations": [
            "\n"
        ]
    },
    {
        "report_id": "FBI_38",
        "report_date": "12/6/2004",
        "report_description": [
            "On 3 December, 2004 this office received a letter from a person who \nsigned his name \"Juan\". This letter, having no return address, was mailed from a post \noffice in Farmers Branch, TX. Like the letter sent to the Houston field office, this one \nsaid that a Type A strain of foot and mouth disease was brought into the USA by persons \nwho had traveled from Cartagena, Columbia, to Guane, Cuba, to Ciudad Madero, Mexico, to \nCiudad Acuna, Mexico, and then on to Victoria, TX. The letter closed by saying that this \nstrain of FMD was a \"little greeting\" from FARC and the ELN.\n"
        ],
        "persons": [
            "Juan\n"
        ],
        "dates": [
            "12/3/2004\n"
        ],
        "places": [
            " /Farmers Branch/Texas/USA; /Cartagena/Columbia/USA; /Guane/ /Cuba; /Ciudad \nMadero/ /Mexico; /Ciudad Acuna/ /Mexico; /Victoria/Texas/USA\n"
        ],
        "organizations": [
            "FARC;ELN"
        ]
    },
    {
        "report_id": "FBI_39",
        "report_date": "12/10/2004",
        "report_description": [
            "Agents tracking domestic websites noted an item posted on a website \ncalled \"Government Secrets\". This website posts information that its sources claim are \nitems of information being kept from the public by the US government. The sources are \nnever identified on the website. On 6 December, 2004 was posted the following item:\"We are \nalways told how secure are the germ labs and storage areas are on Plum Island, just off \nLong Island. This is total BS. We know that fake IDs to get on Plum Island are not hard to \nget. And, we also know that, on 1 December, 2004, samples of a strain of foot and mouth \ndisease was quite easily stolen from Lab 101 on Plum Island. How long is our government \ngoing to keep us in the dark about the lack of security on Plum Island. The safety of our \nfood supply is at stake.\"\n"
        ],
        "persons": [
            "\n"
        ],
        "dates": [
            "12/6/2004;12/1/2004\n"
        ],
        "places": [
            " /Plum Island/ / "
        ],
        "organizations": []
    },
    {
        "report_id": "FBI_40",
        "report_date": "12/13/2004",
        "report_description": [
            "An official of the Majestic Lines, a tourist ship lines reported to us \nan observation made on 29 November, 2004 by one of their booking agents. She said that two \nmen with Middle Eastern names had booked two tours on the same ship for tours that left \njust a month apart. The first tour, aboard the \"Majestic Clipper\", left Miami on 15 \nNovember, 2004 for Nassau, The Bahamas, and returned from  Nassau to Miami on 21 November, \n2004. The second tour would leave Miami for Nassau on 13 December, 2004 and return from \nNassau to Miami on 19 December, 2004. The two persons booking these tours on 20 September, \n2004 were Said Khadr and Muhammed Dandani. Both held U.S. passports. They were booked for \nfirst-class accommodations on the \"Majestic Clipper\" for both of these tours. Khadr and \nDandani took the first tour and are aboard the second.\n"
        ],
        "persons": [
            "Said Khadr;Muhammed Dandani\n"
        ],
        "dates": [
            "11/29/2004;11/15/2004;11/21/2004;12/13/2004;12/19/2004;9/20/2004\n"
        ],
        "places": [
            " /Miami/Florida/USA; /Nassau/ /Bahamas\n"
        ],
        "organizations": []
    },
    {
        "report_id": "FBI_41",
        "report_date": "12/15/2004",
        "report_description": [
            "In light of the information in FBI report for 13 December, 2004, an \nimmediate check was made of other cruise ship lines to see if there were other occurrences \nof such double bookings by Middle Eastern persons. Positive replies were obtained from the \nRoyal Norwegian Lines in New York City and the Sea Aire Lines in Baltimore, MD. Royal \nNorwegian Lines reported that two men named Wali Shakur and Hamza al Midhar had, on 20 \nSeptember, 2004, booked first-class accommodations on the \"Viking Holiday\" that left NYC \non 14 November, 2004 and returned to NYC from Nassau on 21 November, 2004. These same two \nmen had booked first-class accommodations on the same ship that left NYC for Nassau on 12 \nDecember, 2004 and is due to arrive back in NYC on 19 December, 2004. This cruise ship \nleaves Nassau on 18 December, 2004. The Sea Aire Lines reported the following information. \nTwo men named Mounir Mzoudi and Mamoun Zammar had, on 21 September, 2004 booked two first-\nclass accommodations on the \"Caribbean Queen\". The first was for a tour that left \nBaltimore for Freeport, The Bahamas on 7 November, 2004 and returned to Baltimore on 14 \nNovember, 2004. The second was for a tour on the \"Caribbean Queen\" that left Baltimore for \nFreeport on 12 December, 2004 and is due to arrive back in Baltimore on 19 December, 2004. \nThis ship leaves Freeport on 17 December, 2004.\n",
            "A Russian named Igor Kolokov was arrested in Cairo on 29 January, 2003 \nand charged with assault on an Egyptian police officer who had attempted to arrest him for \nbeing drunk in public. Kolokov sells medical supplies throughout the Middle East and \nrepresents a company in  Moscow called Medikat. A background check on Kolokov reveals that \nhe was formerly an administrator at the Soviet institute Vector in Strizi, near Kirov in \nRussia. When he was arrested, Kolokov was carrying a card with a note on it reading [in \nRussian]: \"Safrygin for H. Q., Peshawar.\"\n"
        ],
        "persons": [
            "Wali Shakur;Hamza al Midhar;Mounir Mzoudi;Mamoun Zammar\n",
            "Igor Kolokov\n"
        ],
        "dates": [
            "9/20/2004;11/14/2004;11/21/2004;12/12/2004;12/19/2004;12/18/2004\n",
            "1/29/2003"
        ],
        "places": [
            "/ New York City/New York/USA; /Baltimore/Maryland/USA;/ Nassau/ /Bahamas; \n/Freeport/ /Bahamas\n"
        ],
        "organizations": []
    }
]